{
	"COMMENT": "NO MANDARIN (YET?)",
	"mce": {
		"1": [
			["We want to find out your name.", "We want to find out your nationality.", "We want to find out your occupation."],
			["We want to find out his nationality.", "We want to find out his name.", "We want to find out his occupation."],
			["We are talking about her occupation.", "We are talking about her nationality.", "We are talking about her name."],
			["None of them is American.", "One of them is American.", "They are both American."],
			["My last name is not Li.", "I am not you.", "I am not a student."]
		],
		"2": [
			["Little Gao has 2 elder brothers and 1 younger sister.", "Little Gao has 1 elder brother and 2 younger sisters.", "Little Gao has 1 elder sister and 2 younger brothers."],
			["Doctor Wang has 6 children.", "Lawyer Zhang has 5 children.", "Lawyer Wang has 7 children."],
			["None of them has a daughter.", "Both of them have daughters.", "Only one of them has daughters."],
			["This photo doesn't belong to Little Li.", "This photo is not yours.", "Little Zhang's photo also belongs to Little Li."],
			["Only one of them is a lawyer.", "They are both lawyers.", "None of them is a lawyer."],
			["It belongs to mom, not dad.", "It belongs to mom and dad.", "It belongs to dad, not mom."]
		],
		"3": [
			["He has 76 pictures.", "He has 16 pictures.", "He has 79 pictures.", "He has 67 pictures."],
			["Teacher Zhang has 98 students.", "Teacher Zhang has 68 students.", "Teacher Zhang has 86 students.", "Teacher Zhang has 18 students."],
			["He knows 34 lawyers.", "He knows 30 teachers.", "He knows 4 lawyers.", "He knows 13-14 teachers."],
			["My father knows 26 doctors.", "My father knows 16 doctors.", "My father knows 12 lawyers.", "My father knows 26 lawyers."],
			["We will invite 40 people.", "We will invite 4 people.", "We will invite 14 people.", "We will invite 10 people."],
			["The 12th is a Sunday.", "The 10th is a Sunday.", "The 12th is a Tuesday.", "The 20th is a Tuesday."],
			["My birthday is November 9.", "My birthday is January 9.", "My birthday is January 6.", "My birthday is November 6."],
			["Tomorrow is April 23.", "Tomorrow is October 13.", "Tomorrow is April 24.", "Tomorrow is October 14."],
			["There are 5 Thursdays in June this year.", "There are 4 Fridays in June this year.", "There are 5 Thursdays in May this year.", "There are 6 Fridays in May this year."],
			["It was October 22, 1974, Tuesday.", "It was April 12, 1974, Sunday.", "It was October 12, 1914, Tuesday.", "It was April 22, 1964, Sunday."]
		],
		"4": [
			["That movie is quite good.", "That movie is not good.", "That movie is not interesting."],
			["Li You often goes to Little Zhang's house.", "Li You goes to Little Zhang's house sometimes.", "Li You often invites Little Zhang."],
			["They are going to play ball this weekend.", "They are going to a movie this weekend.", "They are going to dance this weekend."],
			["He wants to sing a foreign song.", "He wants to go to a foreign country.", "His brother is in a foreign country."],
			["We will go see another movie.", "We will not see any movie today.", "We will see this movie."],
			["I want to watch TV.", "I want to watch movies.", "I want to read a book."]
		],
		"5": [
			["Teacher Zhang did not come to school today.", "Teacher Zhang is not home today.", "Teacher Zhang will not come to school today."],
			["I met 3 Chinese students on Sunday.", "I met 3 Chinese students on Tuesday.", "I will meet 3 Chinese students on Sunday."],
			["They are singing in the library.", "They are chatting in the library.", "They are singing at school."],
			["I drank 8 bottles of water.", "I will drink 8 cups of water.", "I will drink 8 bottles of water."],
			["Wang Peng doesn't work in the library today.", "Wang Peng doesn't work tomorrow.", "Wang Peng works in the library today."],
			["He can't drink beer.", "He can't drink cola.", "He doesn't want to drink beer."],
			["I have tea and coffee.", "I have cola and tea.", "I have coffee and cola."],
			["He is quite talkative.", "I like to chat with him.", "I'd like to get acquinted with him."]
		],
		"6": [
			["They are going to Lawyer Zhang's house this weekend.", "They went to Lawyer Zhang's house last weekend.", "They are going to Teacher Zhang's house this weekend."],
			["The speaker is inside.", "The speaker is outside.", "The speaker doesn't want Little Li to enter."],
			["The third year students have 4 exams this week.", "There are 4 exams on Wednesday.", "The forth year students have 3 exams this week."],
			["The speaker is uneasy to have dinner at Mr Li's place.", "The speaker wants to treat Mr Li to dinner.", "The speaker is quite comfortable to have dinner at Mr. Li's place."],
			["I think he is likely to be back after 9.", "I know he will bw back as 9.", "I want you to call him at 9."],
			["I have 3 classes this morning.", "You have 7 classes today.", "I have 3 classes this afternoon."],
			["Don't drink coffe after dinner.", "Don't sleep at 10 p.m.", "Don't have dinner at 10 p.m."],
			["I will go look for Dr. Zhang for you.", "Why don't you go look for Dr. Zhang!", "Dr. Zhang is very polite."]
		],
		"7": [
			["He gave me a glass of beer.", "He gave me 1 pen.", "He gave me 9 pens."],
			["Today's homework is a little difficult.", "Little Zhang has only a little homework today.", "Little Zhang is a male."],
			["That teacher reads the text too fast.", "That teacher speaks too fast.", "That teacher writes too fast."],
			["I did not study lesson 5 well enough.", "I did not study lesson 5.", "There are 5 lessons I did not study well."],
			["I like the 4th picture.", "I like those 4 pictures.", "I like the 10th picture."],
			["Everybody said that Little Li's boyfriend is handsome.", "Everybody said that Little Li is handsome.", "Little Li said that everyone is handsome."]
		],
		"8": [
			["When I entered your classroom, the teacher was teaching grammar.", "After I entered the classroom, the teacher started to teach grammar.", "Before I entered the classroom, the teacher had already taught grammar."],
			["I was practicing my pronouciation when he came.", "He came to the classroom to practice pronunciation with me.", "He called me to the classroom to practice pronunciation."],
			["Little Zhang was learning to use a computer in his dorm when I went there.", "I asked Little Zhang to my dorm to look at my computer.", "Little Zhang went to my dorm to learn how to use a computer."],
			["Don't drink coffee in class.", "Don't drink coffee before class.", "Don't drink coffee after class."],
			["I will listen to the recording after I review the grammar.", "I will review the grammar after listening to the music.", "I will listen to the recording after I prepare the grammar."],
			["My little sister likes to sing while taking a bath, and I'm used to it now.", "I'm used to singing while taking a bath.", "I like to sing while taking a bath, and my little sister is used to it now."]
		],
		"9": [
			["This shirt is a bit too small.", "The color of this shirt isn't right.", "The color of these pants is quite good."],
			["I want to get a better size.", "I want to get a better color.", "I want to get larger shoes."],
			["I like brown color pants, but I will get them later.", "I don't like brown color pants.", "I like brown color pants, and I will get them today."],
			["We wear the same size shoes.", "We all wear good shoes.", "We wear shoes of the same color."],
			["These pants are less expensive.", "Those pants are less expensive.", "They are both inexpensive."],
			["He didn't get the change.", "He didn't pay.", "The salesperson didn't look for him."]
		],
		"10": [
			["It hasn't been raining too much lately.", "It hasn't been raining lately.", "It hasn't been raining too heavily lately."],
			["It's more comfortable outside!", "It's really stuffy outside!", "It's really cold in here!"],
			["This spring is a bit cold, but better than winter.", "This spring is warm and comfortable.", "The winter is more comfortable than spring."],
			["I don't want to see him.", "I have never seen him before.", "I am glad to see him again."],
			["Little Zhang likes Shanghai's spring better.", "Little Zhang feels that it is comfortable in spring both in Shanghai and Taipei.", "Little Zhang likes Taipei's spring better."],
			["Please write me a letter in Chinese next time.", "Please write me a letter in Chinese again.", "It was nice of you to have written me a letter in Chinese lest time."]
		],
		"11": [
			["I did not do well on the quiz.", "I asked the teacher how well I did on the quiz.", "I think the quiz was very interesting."],
			["We are going in the afternoon or in the evening.", "We are going in the morning or in the evening.", "Are we going in the afternoon or in the evening?"],
			["I will visit my sister during the winter break.", "My sister is going to Shanghai today.", "I will go home to see my sister today."],
			["I want to stay home.", "I want to go to a concert.", "Are we going to a concert or stay home?"],
			["He doesn't read the newspaper while eating.", "He eats breakfast while reading the newspaper.", "He takes a shower right after breakfast."],
			["I will take the subway to the airport.", "I will drive to the airport.", "If you can't take me to the airport, I'll take the subway."]
		],
		"12": [
			["This person wants Old Wang to order.", "This person wants Old Wang to bring over the food.", "This person wants Old Wang to eat a little food."],
			["This person is ordering dumplings.", "The dumplings have arrived.", "This person is asking someone to come over and eat dumplings."],
			["We don't want any meat.", "We want some meat.", "We want some vinegar."],
			["I don't recognize any of the characters you wrote.", "There is one character you wrote that I don't recognize.", "I don't recognize your writing either."],
			["I didn't see clearly who he was.", "I didn't look, so I'm not clear who he was.", "We all saw clearly who he was."],
			["He sang 4 songs.", "He sang 1 song.", "He sang 3 songs."]
		],
		"13": [
			["I won't be able to return the books.", "I have returned the books.", "I am going to return the books now."],
			["You can use either your library card or credit card.", "You can only use your credit card here.", "You can only use your library card here."],
			["He wants to know how much longer he could keep the tape.", "He wants to know how much he would be fined if the tape was returned late.", "He wants to know if he could renew the tape."],
			["$6.", "$2.", "$3."],
			["I've brought over a dictionary.", "I've brought over 8 dictionaries.", "I've borrowed a dictionary from Little Zhang."],
			["I probably left my ID in the library.", "I probably left my ID at home.", "I probably left my ID in the computer lab."]
		],
		"14": [
			["The sports field is to the west of the activity center.", "The sports field is to the east of the activity center.", "The sports field is to the south of the activity center."],
			["We didn't know that Little Tian has never seen that movie.", "We knew that Little Tian has never seen that movie.", "We invited Little Tian to the movie."],
			["Little promised to call us soon.", "Little Zhang has arrived to Tokyo.", "Little Zhang called us from Japan."],
			["I can definitely find his house.", "I will take a look of his house.", "I have been to his house."],
			["The book store is very close.", "The book store is a little far from here.", "The book store is right here."],
			["I might go to Chinatown with Little Xie.", "I am not busy tomorrow.", "Little Xie will drive to Chinatown today."]
		],
		"15": [
			["Your cousin's son is really cute.", "Your cousin is really cute.", "Your cousin's son is thirsty."],
			["I can get more fruit if necessary.", "If you didn't get enough fruit, then you go get more!", "I've only bought a little bit fruit."],
			["I went to the summer school two years ago.", "I got to know you two years ago.", "I got to know your cousin last year."],
			["I look more like my dad.", "I walk the same way as my dad.", "I look more like my mom."],
			["He must be still sleeping.", "He must be still dancing.", "He went to bed while everyone was dancing."],
			["An intelligent and diligent boy came to see me yesterday.", "The boy who came to see me was very diligent but not too smart.", "The boy who came to see me was very smart but not too diligent."]
		],
		"16": [
			["I don't want to get a shot because it hurts.", "I think the medicine will ease my pain.", "Although I feel a lot of pain now, I still don't want a shot."],
			["Little Wang should return the books soon.", "Little Wang's books are over-due.", "Little Wang has returned the books."],
			["He goes to language lab everyday to improve his Chinese.", "He goes to language lab everyday to help out.", "The teacher listens to the tapes in the language lab."],
			["My stomach hurts more and more although I've been resting.", "My stomach hurts more and more during class.", "I want to lie down, because my stomach hurts."],
			["You don't have a serious illness yet.", "Because your illness is serious, you should get health insurance.", "Don't get health insurance because it's too expensive."],
			["He cried quite a few times yesterday.", "He was sad yesterday, so he called his dad.", "His dad called him once yesterday, and he cried afterwards."]
		],
		"17": [
			["He didn't leave me a good impression.", "I didn't leave him a good impression.", "I don't treat him too well."],
			["He has two houses.", "He has a few houses.", "He has two rooms."],
			["We've been living in the same house for a year now.", "I didn't know him till a year ago.", "I've known him for a year now."],
			["I bought an opera ticket after a lot of trouble.", "I bought an opera ticket without trouble.", "I bought a plane ticket."],
			["I'll postpone our celebration till you get back.", "Wish you a great journey!", "You are back from the trip now. Let's celebrate!"],
			["I don't think I have enough time.", "I think I have plenty of time.", "I will take a 10 minutes break from the cleaning."]
		],
		"18": [
			["This bedroom can hold a single bed and two chairs.", "This bedroom can hold a single bed and two tables.", "This bedroom can hold a desk and 2 chairs."],
			["Nobody in our class knew about the test today.", "Everyone in our class knew that there's going to be a test today.", "Who doesn't know there is a test today?"],
			["I've seen over 10 apartments and I'm still looking.", "I've seen 10 apartments and I'm still looking.", "I saw 10 apartments before I found one."],
			["The renter needs to pay three months' rent when he/she moves in.", "The renter needs to pay two months' rent when he/she moves in.", "The renter needs to pay one month's rent when he/she moves in."],
			["Their sofa is under $30.", "It costs $20 to put an ad on the newspaper to sell a sofa.", "They ask for $20 for their sofa."],
			["We don't have a desk.", "We don't have any table.", "We don't have a dinning table."]
		],
		"19": [
			["He always came late.", "His teacher came late.", "He usually came early, but today he is late."],
			["I have sent 3 letters.", "I have sent 2 letters.", "I have sent 1 letter."],
			["This person is a student from the UK, who is studying in Beijing.", "This person is a Chinese from Beijing, who is studying in the UK.", "This person is a Beijing University student, who is studying English."],
			["I bought 3 kinds of vegetable.", "I bought 1 kind of vegetable.", "I bought 4 kinds of vegetable."],
			["The small cucumbers are more expensive than the big ones.", "This kind of cucumbers is getting cheaper and cheaper now.", "The small cucumbers are more expensive than the big ones."],
			["He has 3 or 4 good friends.", "He has 34 good friends.", "He has 30 good friends."]
		],
		"20": [
			["I could tell that you are a little worried.", "You are worried because I came out.", "You are worried because I started to listen."],
			["Your car is very easy to drive.", "It's good that you are driving your car.", "You drive very well."],
			["He started to read the book after he found out it's interesting.", "He could tell the book is interesting.", "I told him reading is interesting, so he got up."],
			["I won't turn it off if you still want to watch.", "You can start watching TV now.", "You can go downstairs to watch TV."],
			["The last time I studied Chinese was four days ago.", "It has been four days since I studied Chinese.", "I studied Chinese for 4 days."],
			["I didn't know you were unhappy.", "I knew you were happy.", "I knew you were unhappy."]
		],
		"21": [
			["I will eat what you eat.", "You should eat what I eat.", "I don't know what you and I are going to eat."],
			["Some airline companies are lowering their ticket price.", "All airline companies are lowering their ticket price.", "All airline companies are raising their ticket price."],
			["My account balance is below $500.", "My account balance is over $500.", "I'm not going to the bank to get $500."],
			["He has left for Chicago.", "He wants to walk around Chicago.", "He has walked to Chicago."],
			["It's not easy to get a visa now.", "It's quite easy to get a visa now.", "It's not good to get a visa now."],
			["I would like to have a discount.", "Can the sales person make a phone call?", "I wonder if I could make a phone call."]
		],
		"22": [
			["Your hometown is not in California.", "Your hometown is in California.", "Because you are getting old, so you move to California."],
			["Forget it if you don't have time to go.", "Forget it if you don't have time to talk.", "Forget it if you don't have time to buy the flower."],
			["Sounds like you are not welcome.", "I heard that you are not welcome.", "Sounds like you are not welcome."],
			["There are some little hills on the right side of my grandma's house.", "There are some little hills behind my grandma's house.", "There are some little hills on the left side of my grandma's house."],
			["She is wearing a red blouse.", "She is putting on a red blouse.", "She is going to wear a red blouse."]
		],
		"23": [
			["I have three pieces of baggage.", "I have two pieces of baggage.", "I have one piece of baggage."],
			["I felt warn out.", "I cried on the road.", "I had a smooth journey."],
			["I think Teacher Wang is young.", "I think Teacher Wang is old.", "I guess Teacher Wang is 30 this year."],
			["I'm almost done with the homework.", "I'm done with the homework already.", "I think there is too much homework today."],
			["I think today's weather is not too bad.", "I think today's weather is really good.", "I think today's weather is really bad."]
		]
	},
	"mcc": {
		"1": [
			["你好！", "你呢？", "我好！"],
			["我是學生，你呢？", "你是學生。", "你不是學生。"],
			["我姓王，我叫王貴生。", "我貴姓王。", "我姓王先生，叫王貴生。"],
			["我也是學生。", "我叫李友。", "我不是美國人。"],
			["我也不是老師。", "我也是學生。", "我是美國人。"],
			["老師姓李，是中國人。", "老師叫李，是中國人。", "老師不是中國人。"],
			["王朋不是中國人。", "王朋不是美國人。", "王朋是老師。"],
			["李先生不是美國老師。", "李先生是學生。", "李老師是美國人。"]
		],
		"8": [
			["哪裡！", "謝謝！", "不客氣！"],
			["我想知道你什麼時候洗澡。", "我想知道你要不要洗澡。", "我想知道你要睡覺還是要起床。"],
			["我請了三個人。", "我請了兩個人。", "我請了一個人。"],
			["今天我寫信了，也學習了。 ", "今天我沒學習，可是寫信了。", "今天我做功課了，也聊天兒了。"],
			["早上我和小高都去餐廳了。", "我和小高一起喝咖啡了。", "小高去餐廳找我了。"],
			["這個學期李老師教兩個課。", "這個學期李老師只教中文。", "這個學期李老師只教電腦。"],
			["我現在不能用中文寫信。", "我現在要用中文寫信。", "我不會用中文寫信。"],
			["他最近常常吃飯的時候寫漢字。", "最近他常常跟他的孩子一起吃早飯。", "他最近常常不吃早飯。"]
		]
	},
	"tof": {
		"2": [
			["2221", "小高和小王都不是医生。", true],
			["2222", "那不是他的照片。", false],
			["2223", "张医生的孩子叫张文。", true],
			["2224", "王律师有六个孩子。", false],
			["2225", "哥哥，姐姐不都有照片。", true],
			["2226", "他弟弟，妹妹都不是学生。", false]
		],
		"4": [
			["4221", "我不想看书，也不想打球。", true],
			["4222", "我很喜欢你的外国书。", true],
			["4223", "我们不想去跳舞。", false],
			["4224", "我觉得你喜欢听音乐。", true],
			["4225", "他们不常看电视。", false],
			["4226", "小张周末常常去跳舞。", false]
		],
		"5": [
			["5221", "我现在只想喝水。", true],
			["5222", "小张是我哥哥的同学。", false],
			["5223", "小高现在在学校。", true],
			["5224", "你姐姐的朋友很漂亮。", false],
			["5225", "我想喝这瓶可乐。", true]
		],
		"6": [
			["6221", "我不知道谁给我打电话。", true],
			["6222", "李老师现在在他的办公室。", true],
			["6223", "我下午三点以后有四节课。", false],
			["6224", "我今天没去小高家。", true],
			["6225", "你今天别给他打电话。", true],
			["6226", "我很想认识张先生。", true],
			["6227", "我们星期一下午开会。", false],
			["6228", "我下午四点在王老师的办公室。", true]
		],
		"7": [
			["7221", "这课的课文不太容易。", true],
			["7222", "我认识一个男医生。", false],
			["7223", "我们都陶录音了。", false],
			["7224", "你们开始得太晚了。", true],
			["7225", "我想学怎么跳中国舞。", true],
			["7226", "这个月的第三个星期日是十五号。", false],
			["7227", "今天他来得很早。", false],
			["7228", "我今天不想上课。", true]
		],
		"9": [
			["9231", "这件黄衬衫大小不合适。", true],
			["9232", "我的衣服跟他的衣服一样大。", false],
			["9233", "他最喜欢咖啡色的裤子。", false],
			["9234", "我想知道你穿多大的鞋。", true],
			["9235", "我买了一个东西。我想知道付多少钱。", false],
			["9236", "小张用电脑。我们不用电脑。", false],
			["9237", "我的黑鞋跟哥哥的不一样多。", true]
		],
		"10": [
			["a221", "小李的裤子比小王的大。", true],
			["a222", "黄的比白的贵。", false],
			["a223", "我昨天除了练习汉字以外，还复习了语法。", true],
			["a224", "这双鞋又便宜又合适。", false],
			["a225", "张老师今天会来上课。", false],
			["a226", "你穿黑裤子不合适。", false],
			["a227", "刚才下雨了。", true],
			["a228", "以前我不去那个公园。", false]
		],
		"11": [
			["b221", "我们要换一次车。", true],
			["b222", "星期六他十一点睡觉。", false],
			["b223", "你最好坐飞机。", true],
			["b224", "我吃晚饭以前练习汉字。", true],
			["b225", "小李想他考试不会考得很好。", true],
			["b226", "我开汽车的时候觉得很紧张。", false],
			["b227", "我们会坐地铁或者坐公共汽车。", true],
			["b228", "今天小张要自己练习汉字。", false]
		],
		"12": [
			["12s2.1", "我觉得她的男朋友很好看。", true],
			["12s2.2", "我们买到糖醋鱼了。", false],
			["12s2.3", "我只想看一个你给我们介绍的电影。", false],
			["12s2.4", "现在每张桌子都有人用。", true],
			["12s2.5", "李友还没做完功课呢。", true],
			["12s2.6", "我吃一两米饭不够。", false]
		],
		"13": [
			["13s2.1", "我们开到晚上九点。", true],
			["13s2.2", "他到纽约去学开车了。", false],
			["13s2.3", "我的借书证现在不在职员那儿。", true],
			["13s2.4", "现在两点钟。", false],
			["13s2.5", "我们吃了四十个饺子。", false],
			["13s2.6", "这本书必须后天以前还。", true]
		],
		"14": [
			["14s2.1", "李小红在小叶和小王中间。", true],
			["14s2.2", "前边的路不能往左拐。", true],
			["14s2.3", "金小姐考试考得最好。", true],
			["14s2.4", "如果你要去活动中心，就得往右拐，往前走。", false],
			["14s2.5", "我没走路去。", true],
			["14s2.6", "我们现在不知道怎么走了。", true]
		],
		"15": [
			["15s2.1", "我女朋友的书够了。", false],
			["15s2.2", "我爸爸说我应该给你打电话。", true],
			["15s2.3", "他很想在你家认识我哥哥。", false],
			["15s2.4", "小林早就想买钢琴了。", true],
			["15s2.5", "昨天我们班的同学都在实验室等你。", false],
			["15s2.6", "这几瓶汽水一定是别人买的。", true]
		],
		"16": [
			["16s2.1", "我很忙，而且我觉得那个电影没有意思。", true],
			["16s2.2", "昨天比今天暖和。", true],
			["16s2.3", "我一个星期吃两次剩饭。", false],
			["16s2.4", "因为她很想家，所以流眼泪了。", true],
			["16s2.5", "他现在还在药店里头。", true],
			["16s2.6", "因为他病了，所以我们得让他吃药。", false]
		],
		"17": [
			["17s2.1", "明天我一定会请客。", true],
			["17s2.2", "我不记得他的电话号码了。", true],
			["17s2.3", "星期天晚上我去跳舞了。", false],
			["17s2.4", "他不会还你这本书。", true],
			["17s2.5", "我不吃剩饭。", false],
			["17s2.6", "唱完中国歌以后，我没有唱别的歌。", true]
		],
		"18": [
			["18s2.1", "我觉得这个书架太小了。", true],
			["18s2.2", "我住的地方没有动物。", false],
			["18s2.3", "这个地方一点儿都不安静。", true],
			["18s2.4", "我得用好几张纸才能写完那么多字。", true],
			["18s2.5", "说话的人问小王下个星期什么时候去找他。", false],
			["18s2.6", "我觉得这个字不难写。", true]
		],
		"19": [
			["19s2.1", "他希望我们早一点儿去。", true],
			["19s2.2", "刚才下雨下得比现在大。", false],
			["19s2.3", "今天邮局里没有五分钱的邮票。", true],
			["19s2.4", "我今天又要寄信，又要买明信片。", true],
			["19s2.5", "我家离学校很近。", false],
			["19s2.6", "你贴的邮票不够。", true]
		],
		"20": [
			["20s2.1", "小李把那个人踢伤了。", false],
			["20s2.2", "我昨天晚上游泳游了一个钟头。", true],
			["20s2.3", "他觉得看中文电视可以提高中文听力。", true],
			["20s2.4", "我觉得你不会受伤。", false],
			["20s2.5", "我觉得夏天跑步不舒服。", true],
			["20s2.6", "妹妹觉得游泳很危险。", true]
		],
		"21": [
			["21s2.1", "这件衣服现在打七五折。", true],
			["21s2.2", "我想去看一个有意思的电影。", true],
			["21s2.3", "他去香港以后就不打算回来了。", false],
			["21s2.4", "我今年二十岁了。", false],
			["21s2.5", "我知道他什么时候到韩国，什么时候回来。", true],
			["21s2.6", "中华航空公司的票现在便宜一点儿了。", false]
		],
		"22": [
			["22s2.1", "我欢迎你到我住的地方来看看。", true],
			["22s2.2", "这儿夏天下雨下得很多。", false],
			["22s2.3", "我伯伯常一边吃早饭一边看报纸。", true],
			["22s2.4", "我有五个阿姨。", false],
			["22s2.5", "中国的政治中心在北京。", true]
		],
		"23": [
			["23s2.1", "我觉得这个电脑很重。", true],
			["23s2.2", "我还没找到机票。", false],
			["23s2.3", "我怕你忘了带护照。", true],
			["23s2.4", "老李准备去台北工作。", false],
			["23s2.5", "小白是星期四来看我的。", true]
		]
	},
	"fil": {
		"1": [],
		"2": [],
		"3": [],
		"4": [],
		"5": [],
		"6": [],
		"7": [],
		"8": [],
		"9": [],
		"10": [],
		"11": [],
		"12": [],
		"13": [],
		"14": [],
		"15": [],
		"16": [],
		"17": [],
		"18": [],
		"19": [],
		"20": [],
		"21": [],
		"22": [],
		"23": []
	},
	"mix": {
		"1": [
			[
				["我", "也", "是", "美国", "学生", "。"],
				[0, 1, 2, 3, 4, 5]
			],
			[
				["李", "小姐", "不", "叫", "李友", "。"],
				[0, 1, 2, 3, 4, 5]
			],
			[
				["王", "老师", "叫", "什么", "名字", "？"],
				[0, 1, 2, 3, 4, 5]
			],
			[
				["我", "姓", "李", "。", "你", "呢", "？"],
				[0, 1, 2, 3, 4, 5, 6]
			]
		],
		"2": [
			[
				["他", "爸爸", "妈妈", "都", "是", "律师", "。"],
				[0, 1, 2, 3, 4, 5, 6],
				[0, 2, 1, 3, 4, 5, 6]
			],
			[
				["王朋", "和", "李友", "都", "没有", "弟弟", "。"],
				[0, 1, 2, 3, 4, 5, 6],
				[2, 1, 0, 3, 4, 5, 6]
			],
			[
				["我", "也", "不", "是", "律师", "。"],
				[0, 1, 2, 3, 4, 5]
			],
			[
				["你", "朋友", "也", "是", "美国人", "吗", "？"],
				[0, 1, 2, 3, 4, 5, 6]
			],
			[
				["我", "有", "三个", "姐姐", "。", "你", "呢？"],
				[0, 1, 2, 3, 4, 5, 6]
			],
			[
				["他", "哥哥", "做", "什么", "？"],
				[0, 1, 2, 3, 4]
			],
			[
				["小王", "有", "几", "张", "照片", "？"],
				[0, 1, 2, 3, 4, 5]
			],
			[
				["那", "个", "女孩子", "是", "中国人", "吗", "？"],
				[0, 1, 2, 3, 4, 5, 6]
			],
			[
				["这", "是", "他", "儿子", "的", "照片", "。"],
				[0, 1, 2, 3, 4, 5, 6]
			],
			[
				["这", "是", "谁", "的", "孩子", "？"],
				[0, 1, 2, 3, 4, 5]
			]
		],
		"4": [
			[
				["他", "周末", "常常", "去", "看", "电影", "。"],
				[0, 1, 2, 3, 4, 5, 6],
				[1, 0, 2, 3, 4, 5, 6]
			],
			[
				["我", "朋友", "只", "喜欢", "听", "外国", "音乐", "。"],
				[0, 1, 2, 3, 4, 5, 6, 7]
			],
			[
				["我们", "晚上", "去", "跳舞", "好吗", "？"],
				[0, 1, 2, 3, 4, 5],
				[1, 0, 2, 3, 4, 5]
			],
			[
				["小张", "觉得", "美国", "电影", "没", "有意思", "。"],
				[0, 1, 2, 3, 4, 5, 6],
				[2, 3, 0, 1, 4, 5, 6]
			],
			[
				["算了", "我", "去", "找", "别的", "律师", "。"],
				[0, 1, 2, 3, 4, 5, 6]
			],
			[
				["他", "只", "想", "请", "王先生", "吃", "晚饭", "。"],
				[0, 1, 2, 3, 4, 5, 6, 7],
				[4, 1, 2, 3, 0, 5, 6, 7]
			],
			[
				["我们", "明天", "请", "高文", "吃饭", "怎么样", "？"],
				[0, 1, 2, 3, 4, 5, 6],
				[1, 0, 2, 3, 4, 5, 6]
			],
			[
				["好久", "不见", "，", "周末", "你", "也", "去", "小高", "周末", "吗", "？"],
				[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
				[0, 1, 2, 3, 7, 5, 6, 4, 8, 9, 10],
				[0, 1, 2, 4, 3, 5, 6, 7, 8, 9, 10],
				[0, 1, 2, 7, 3, 5, 6, 4, 8, 9, 10]
			]
		],
		"5": [
			[
				["我", "现在", "在", "图书馆", "工作", "。"],
				[0, 1, 2, 3, 4, 5],
				[1, 0, 2, 3, 2, 5]
			],
			[
				["我们", "一起", "去", "图书馆", "看", "书", "吧", "！"],
				[0, 1, 2, 3, 4, 5, 6, 7]
			],
			[
				["去年", "他", "去", "中国", "了", "。"],
				[0, 1, 2, 3, 4, 5],
				[1, 0, 2, 3, 4, 5]
			],
			[
				["小张", "喝", "了", "三", "瓶", "啤酒", "。"],
				[0, 1, 2, 3, 4, 5, 6]
			],
			[
				["我", "哥哥", "晚上", "十一点半", "才", "回家", "。"],
				[0, 1, 2, 3, 4, 5, 6],
				[2, 0, 1, 3, 4, 5, 6],
				[2, 3, 0, 1, 4, 5, 6]
			],
			[
				["你们", "周末", "看", "电影", "了", "吗", "？"],
				[0, 1, 2, 3, 4, 5, 6],
				[1, 0, 2, 3, 4, 5, 6]
			],
			[
				["我", "妈妈", "十一月", "才", "去", "中国", "。"],
				[0, 1, 2, 3, 4, 5, 6],
				[2, 0, 1, 3, 4, 5, 6]
			],
			[
				["昨天", "我", "认识", "了", "两个", "律师", "。"],
				[0, 1, 2, 3, 4, 5, 6],
				[1, 0, 2, 3, 4, 5, 6]
			]
		],
		"7": [
			[
				["我", "朋友", "唱歌", "唱", "得", "不", "好", "。"],
				[0, 1, 2, 3, 4, 5, 6, 7]
			],
			[
				["我", "十点三刻", "才", "给", "他", "打电话", "。"],
				[0, 1, 2, 3, 4, 5, 6],
				[1, 0, 2, 3, 4, 5, 6],
				[4, 1, 2, 3, 0, 5, 6],
				[1, 4, 2, 3, 0, 5, 6]
			],
			[
				["怎么", "你", "现在", "才", "来", "？"],
				[0, 1, 2, 3, 4, 5],
				[1, 0, 2, 3, 4, 5],
				[0, 2, 1, 3, 4, 5]
			],
			[
				["第", "二", "个", "汉字", "我", "写", "得", "太", "小", "了", "。"],
				[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
				[4, 0, 1, 2, 3, 5, 6, 7, 8, 9, 10]
			],
			[
				["你", "怎么", "不", "认识", "你们", "老师", "？"],
				[0, 1, 2, 3, 4, 5, 6],
				[1, 0, 2, 3, 4, 5, 6],
				[4, 5, 1, 2, 3, 0, 6],
				[1, 4, 5, 2, 3, 0, 6]
			],
			[
				["昨天", "的", "电影", "有", "一点儿", "没意思", "。"],
				[0, 1, 2, 3, 4, 5, 6],
				{
					"COMMENT": [0, 1, 5, 2, 4, 3, 6]
				}
			]
		],
		"22": [
			[
				["妈妈", "不让", "弟弟", "看", "着", "电视", "做", "功课", "。"],
				[0, 1, 2, 3, 4, 5, 6, 7, 8]
			],
			[
				["麻州", "的", "冬天", "冷", "是", "冷", "可是", "很", "漂亮", "。"],
				[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
			],
			[
				["那", "条", "河", "的", "两边", "种", "着", "很多", "树", "。"],
				[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
			],
			[
				["那个", "导游", "好", "是", "好", "但是", "不会", "说", "英文", "。"],
				[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
			],
			[
				["那张", "桌子", "上", "放", "着", "一个", "电脑", "。"],
				[0, 1, 2, 3, 4, 5, 6, 7]
			]
		]
	},
	"ant": {
		"10": [
			["贵", "便宜"],
			["进", "出"],
			["小", "大"],
			["对", "错"],
			["白", "黑"],
			["暖和", "凉快"],
			["来", "去"],
			["晚", "早"],
			["快", "慢"],
			["热", "冷"],
			["难", "容易"],
			["睡觉", "起床"]
		]
	},
	"typ": {
		"1": [
			["请问，您_____什么名字？", "叫"],
			["你是美国老师_____？", "吗"],
			["我也_____老师。", "是"],
			["我不_____李。", "姓"],
			["我姓王，你_____？", "呢"]
		],
		"2": [
			["小高不_____律师。", "是"],
			["请_____他是谁？", "问"],
			["我有两个哥哥。你_____？", "呢"],
			["这_____照片不是我的。", "张"],
			["那是谁_____照片？", "的"],
			["他有几_____妹妹？", "个"],
			["我有孩子，他没有孩子。我们_____有孩子。", "不都"],
			["我没有孩子，他也没有孩子。他们_____没有孩子。", "都"],
			["我也有五_____照片。", "张"],
			["那_____美国人也是老师。", "个"]
		],
		"9": [
			["我认识四_____医生。", "个", "位"],
			["上个月我写了十_____日记。", "篇"],
			["小张买了三_____新衬衫。", "件"],
			["这_____裤子太小了。", "条"],
			["小姐，我想换一_____鞋。", "双"],
			["昨天我用中文给妈妈写了一_____信！", "封"],
			["今天张老师要教四_____课。", "节"],
			["那_____照片是你的吗？", "张"],
			["一_____咖啡多少钱？", "杯"],
			["小高买了六_____啤酒。", "瓶", "杯"]
		],
		"19": [
			["20 or 30 lawyers: _____个律师", "二三十"],
			["$300 or $400: _____块钱", "三四百"],
			["80-90 books: _____本书", "八九十"],
			["4 or 5 weeks: _____个星期", "四五"],
			["15 or 16 months: _____个月", "十五六"],
			["1 or 2 days: _____天", "一两"]
		]
	},
	"que": {
		"3": [
			["你今年多大？"],
			["现在几点？", "现在几点钟？"],
			["明天星期几？"],
			["你的生日是几月几号？"],
			["那年是一九九几年？"],
			["你们老师姓什么？"],
			["那是谁？", "那是谁的妹妹？", "那是谁妹妹？"],
			["这张照片是谁的？"],
			["他有几个弟弟？", "谁有四个弟弟？"],
			["你爸爸做什么？", "谁是律师？", "谁的爸爸是律师？", "谁爸爸是律师？"]
		]
	},
	"alt": {
		"3": [
			["他是你弟弟吗？", "他是不是你弟弟？"],
			["李老师有孩子吗？", "李老师有没有孩子？"],
			["今天你请我吃饭吗？", "今天你请不请我吃饭？"],
			["你们喜欢吃饭吗？", "你们喜欢不喜欢吃饭？"],
			["你认识张律师吗？", "你认识不认识张律师？"],
			["明天是星期三吗？", "明天是不是星期三？"],
			["你晚上有事吗？", "你晚上有没有事？"],
			["那张照片是你的吗？", "那张照片是不是你的？"],
			["你现在忙吗？", "你现在忙不忙？"],
			["你的医生好吗？", "你的医生好不好？"]
		]
	},
	"num": {
		"1": [
			"你住多少号？",
			438,
			842,
			639,
			528,
			367,
			451,
			904,
			380,
			397,
			"你的电话号码是多少？",
			6423480,
			4856304,
			7345025,
			9872216,
			3638800,
			5284974
		]
	},
	"tim": {
		"3": [
			"07:15",
			"06:20",
			"08:40",
			"11:05",
			"02:02",
			"11:50",
			"09:45",
			"06:45",
			"02:58",
			"05:30"
		]
	},
	"mon": {
		"9": [
			"673.50",
			"24.63",
			"406.94",
			"142.05",
			"820.37",
			"57.22"
		]
	}
}
